# CelsiusInterval Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..CelsiusInterval Property
UnitTypeId Class See Also
---
Celsius interval.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CelsiusInterval { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CelsiusInterval As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CelsiusInterval {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace